#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-Fp6AuCGf52gM8Rti

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
aws_s3_bucket.creative-corners: Refreshing state... [id=creative-corners]
aws_route53_record.imap_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_imap.shapeshed.com_CNAME]
aws_route53_record.__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.moxie_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.moxie_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]
aws_route53_record.__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__8e912589f272071e6beb0f31146b9819.www.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_SOA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]
aws_route53_record.shapeshed__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed._domainkey.shapeshed.com_TXT]
aws_route53_record.mx02_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_AAAA]
aws_route53_record.finney_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_AAAA]
aws_route53_record.shapeshed_com_MX: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
aws_route53_record.__acme-challenge_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__acme-challenge.shapeshed.com_TXT]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_NS: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.moxie__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie._domainkey.shapeshed.com_TXT]
aws_route53_record.mx01_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_A]
aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com_CNAME]
aws_route53_record.mail_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mail.shapeshed.com_CNAME]
aws_route53_record.mx01_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_AAAA]
aws_route53_record.__dmarc_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__dmarc.shapeshed.com_TXT]
aws_route53_record.mx02_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_A]
aws_route53_record.yandex-verification_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_yandex-verification.shapeshed.com_TXT]
aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shgsbo4u9t.shapeshed.com_CNAME]
aws_route53_record.finney_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_A]
aws_route53_record.smtp_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_smtp.shapeshed.com_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_acl.creative-corners_acl will be created
  + resource "aws_s3_bucket_acl" "creative-corners_acl" {
      + acl    = "private"
      + bucket = "creative-corners"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_public_access_block.creative-corners_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "creative-corners_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "creative-corners"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.creative-corners_bucket_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "creative-corners_bucket_encryption" {
      + bucket = "creative-corners"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.creative-corners_versioning will be created
  + resource "aws_s3_bucket_versioning" "creative-corners_versioning" {
      + bucket = "creative-corners"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @shapeshed, Action: `pull_request`*